## Lab work 2. 
### Task 2
#### 1. First import Pandas, NumPy, Matplotlib. Then import Data Churn_Modelling.csv using read_csv() method and show the data using head() and its shape.

In [53]:
import numpy as np
import pandas as pd
import matplotlib

df = pd.read_csv('C:/Users/Gaukhartas/Desktop/ml/lab2/datasets/Churn_Modelling.csv')
df.head()
print(df.shape)

(10000, 14)

#### 2. Apply info() for dataframe and observe missing data.

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              9993 non-null   float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

#### 3. You can observe missing data only for Age feature. it is recommended to fill the missing data. Determine the way to fill it. You can fill data with mean or median value, write down explanation of your choice.

In [55]:
df.Age.median()

37.0

In [56]:
df.Age.mean()

38.92154508155709

In [57]:
df.groupby('Geography').Age.median()

Geography
France     37.0
Germany    38.0
Spain      37.0
Name: Age, dtype: float64

In [58]:
df.Age.fillna(df.Age.median, inplace=True)

In [59]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

#### 4. Categorical Feature Encoding. Using get_dummies() function encode 'Geography' feature. Here must be 2 arguments, first is dataframe, second is list of features.¶

#### 5. Categorical Feature Encoding. Next, you need to encode Gender. Create a new feature, called 'isMale', using where() function.¶

In [60]:
df['isMale'] = np.where(df.Gender=='male', 1, 0)

In [61]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,isMale
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1,0
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,0
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0

#### 6. After encoding we don't need 'Geography', 'Gender' features. Also you can delete CustomerId feature. As a result delete them and don't forget about inplace argument.

In [62]:
df.drop(['CustomerId', 'Surname', 'Gender'], axis=1, inplace=True)

#### 8. Divide the data into training and test data! We set aside 30% of the data to test the quality of the model. The remaining 70% is taken for training. To split data use train_test_split() function, don't forget to import it from sklearn.model_selection.

In [69]:
from sklearn.model_selection import train_test_split
df_train, df_test = train_test_split(df, test_size = 0.3)

#### 7. Feature scaling. Here we need to make standardization of variables. It subtracts the mean from each variable and divide by the standard deviation. This clears the variables of their unique scales and makes it easier for the algorithm to reach the optimal point. 
#### First, import StandardScaler() form sklearn.preprocessing. 
#### Declare scaler and initialize it using StandardScaler() function.
#### Use fit() and it takes ['Age', 'CreditScore', 'Balance', 'EstimatedSalary'] features of dataframe, because, those should to be standardized.

In [64]:
df.head()

,RowNumber,CreditScore,Geography,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,isMale
0,1,619,France,42,2,0.00,1,1,1,101348.88,1,0
1,2,608,Spain,41,1,83807.86,1,0,1,112542.58,0,0
2,3,502,France,42,8,159660.80,3,1,0,113931.57,1,0
3,4,699,France,39,1,0.00,2,0,0,93826.63,0,0
4,5,850,Spain,43,2,125510.82,1,1,1,79084.10,0,0

#### 8. Apply the scaler to the train using transform() function.

In [71]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(df_test[['Age', 'CreditScore', 'Balance', 'EstimatedSalary']])

TypeError: float() argument must be a string or a number, not 'method'

#### 9. Apply the scaler to the test using transform() function.

#### 10. Replace the values of train with the scaled ones.

#### 11. Replace the values of test with the scaled ones.

#### 12. Show the data using head().